{
  "_name_or_path": "roberta-base",
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-ACCOUNT",
    "1": "B-ADDRESS",
    "2": "B-DATE",
    "3": "B-EMAIL",
    "4": "B-MBI",
    "5": "B-MRN",
    "6": "B-PERSON",
    "7": "B-PHONE",
    "8": "B-SSN",
    "9": "I-ACCOUNT",
    "10": "I-ADDRESS",
    "11": "I-DATE",
    "12": "I-EMAIL",
    "13": "I-MBI",
    "14": "I-MRN",
    "15": "I-PERSON",
    "16": "I-PHONE",
    "17": "I-SSN",
    "18": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ACCOUNT": 0,
    "B-ADDRESS": 1,
    "B-DATE": 2,
    "B-EMAIL": 3,
    "B-MBI": 4,
    "B-MRN": 5,
    "B-PERSON": 6,
    "B-PHONE": 7,
    "B-SSN": 8,
    "I-ACCOUNT": 9,
    "I-ADDRESS": 10,
    "I-DATE": 11,
    "I-EMAIL": 12,
    "I-MBI": 13,
    "I-MRN": 14,
    "I-PERSON": 15,
    "I-PHONE": 16,
    "I-SSN": 17,
    "O": 18
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
